Table of Contents
 Enum Member1DType
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Type of Member 1D
public enum Member1DType
Fields
Beam = 0
Beam member
BeamSlab = 4
Beam slab, rcs element
Column = 1
Column member
Rib = 3
Rib member
Truss = 2
Truss member
Fields
 Name |  Description
 Beam = 0
Beam member
 BeamSlab = 4
Beam slab, rcs element
 Column = 1
Column member
 Rib = 3
Rib member
 Truss = 2
Truss member
 Edit this page